src/cf/Enums/ВидыПрочихДоходовИРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПрочихДоходовИРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезвозмездноеПолучениеИмуществаРаботУслугИмущественныхПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозмещениеУбытковКПолучениюУплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеАмортизационнойПремии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолевоеУчастиеВИностранныхОрганизациях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолевоеУчастиеВРоссийскихОрганизациях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзлишкиПриИнвентаризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаПрибылиДоРыночныхЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КурсовыеРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КурсовыеРазницыПоРасчетамВУЕ</Name>
					<Comment>Курсовые разницы по расчетам в у.е.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛиквидацияОсновныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогиИСборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПоСписаннойКредиторскойЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацииСФинансовымиИнструментамиСрочныхСделок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацииСФинансовымиИнструментамиСрочныхСделокОР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчисленияВОценочныеРезервы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаВнеоборотныхАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияПокупателю</Name>
					<Comment>Премия, выплаченная покупателю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибыльУбытокПрошлыхЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыКПолучениюУплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыНачисленныеПоСт269</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоГосударственнымЦеннымБумагам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоГосударственнымЦеннымБумагамПоСтавке0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеВнереализационныеДоходыРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеКосвенныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОперационныеДоходыРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеУбыткиПриравненныеКВнереализационнымРасходам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазницаМеждуПервоначальнойИНоминальнойСтоимостьюПоДолговымЦеннымБумагам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаУслугиБанков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыОтСниженияСтоимостиАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияИмущественныхПравКромеПраваТребования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияНематериальныхАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияОбъектовСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияОсновныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияПраваТребованияДоНаступленияСрокаПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияПраваТребованияКакОказанияФинансовыхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияПраваТребованияПослеНаступленияСрокаПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияПрочегоИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаИмуществаВАрендуИлиСубаренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеДебиторскойКредиторскойЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастиеВДругихОрганизациях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШтрафыПениНеустойкиКПолучениюУплате</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыПрочихДоходовИРасходов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область НалогНаПрибыль

// Определяет статьи, квалифицируемые для целей налогового учета как "Внереализационные расходы" (п. 1 ст. 265 НК РФ).
// Не включает статьи, квалифицируемые как "Убытки, приравненные к внереализационным расходам" (п. 2 ст. 265 НК РФ)
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыПрочихДоходовИРасходов
//
Функция ВнереализационныеРасходы() Экспорт
	
	Расходы = Новый Массив;
	
	// Явно упомянутые в п. 1 ст. 265
	Расходы.Добавить(СдачаИмуществаВАрендуИлиСубаренду); // подп. 1
	Расходы.Добавить(ПроцентыКПолучениюУплате); // подп. 2
	Расходы.Добавить(ПроцентыНачисленныеПоСт269); // подп. 2
	Расходы.Добавить(КурсовыеРазницы); // подп. 5 и 6
	Расходы.Добавить(КурсовыеРазницыПоРасчетамВУЕ); // подп. 5 и 6
	Расходы.Добавить(ОтчисленияВОценочныеРезервы); // подп. 7
	Расходы.Добавить(ЛиквидацияОсновныхСредств); // подп. 8
	Расходы.Добавить(ШтрафыПениНеустойкиКПолучениюУплате); // подп. 13
	Расходы.Добавить(ВозмещениеУбытковКПолучениюУплате); // подп. 13
	Расходы.Добавить(НДСПоСписаннойКредиторскойЗадолженности); // подп. 14
	Расходы.Добавить(РасходыНаУслугиБанков); // подп. 15
	Расходы.Добавить(ОперацииСФинансовымиИнструментамиСрочныхСделок); // подп. 18
	Расходы.Добавить(ОперацииСФинансовымиИнструментамиСрочныхСделокОР); // подп. 18
	Расходы.Добавить(ПремияПокупателю); // подп. 19.1
	Расходы.Добавить(ПрочиеВнереализационныеДоходыРасходы); // подп. 20 и иные, не перечисленные выше
	
	// Используемые для целей, не связанных с налогом на прибыль
	Расходы.Добавить(РасходыОтСниженияСтоимостиАктивов);
	Расходы.Добавить(РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд);
	Расходы.Добавить(ДолевоеУчастиеВИностранныхОрганизациях);
	Расходы.Добавить(ДолевоеУчастиеВРоссийскихОрганизациях);
	Расходы.Добавить(УчастиеВДругихОрганизациях);
	Расходы.Добавить(РазницаМеждуПервоначальнойИНоминальнойСтоимостьюПоДолговымЦеннымБумагам);
	
	// Используемые для учета доходов, однако, технически по ним могут быть отражены и расходы.
	// В последнем случае, нет оснований квалифицировать их иначе, чем по подп. 20 п. 1 ст. 265
	Расходы.Добавить(БезвозмездноеПолучениеИмуществаРаботУслугИмущественныхПрав);
	Расходы.Добавить(ПроцентыПоГосударственнымЦеннымБумагам);
	Расходы.Добавить(ПроцентыПоГосударственнымЦеннымБумагамПоСтавке0);
	Расходы.Добавить(ВосстановлениеАмортизационнойПремии);
	Расходы.Добавить(КорректировкаПрибылиДоРыночныхЦен);
	
	Возврат Расходы;
	
КонецФункции

// Определяет статьи, квалифицируемые как "Убытки, приравненные к внереализационным расходам" (п. 2 ст. 265 НК РФ)
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыПрочихДоходовИРасходов
//
Функция ВнереализационныеУбытки() Экспорт
	
	Убытки = Новый Массив;
	
	Убытки.Добавить(ПрибыльУбытокПрошлыхЛет); // подп. 1
	Убытки.Добавить(СписаниеДебиторскойКредиторскойЗадолженности); // подп. 2
	Убытки.Добавить(ПрочиеУбыткиПриравненныеКВнереализационнымРасходам); // подп. 3-7
	
	Возврат Убытки;
	
КонецФункции

// Определяет, используется ли статья для учета операций, связанных с реализацией объектов,
// квалифицируемых в налоговом учете как "амортизируемое имущество".
// По такой статье отражаются обороты и по кредиту (выручка от реализации) и по дебету (стоимость выбывающего объекта).
//
// Параметры:
//  ВидСтатьи - ПеречислениеСсылка.ВидыПрочихДоходовИРасходов - проверяемый вид статьи
// 
// Возвращаемое значение:
//  Булево
//
Функция ИспользуетсяДляРеализацииАмортизируемогоИмущества(ВидСтатьи) Экспорт
	
	Возврат ВидСтатьи = РеализацияОсновныхСредств
		Или ВидСтатьи = РеализацияНематериальныхАктивов;
	
КонецФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать ИспользуетсяДляРеализацииАмортизируемогоИмущества
Функция ИспользуетсяДляДоходов(ВидСтатьи) Экспорт
	
	Возврат ИспользуетсяДляРеализацииАмортизируемогоИмущества(ВидСтатьи);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
